GNU Prolog 1.4.4 (64 bits)
Compiled Nov  6 2014, 18:04:28 with gcc
By Daniel Diaz
Copyright (C) 1999-2013 Daniel Diaz
| ?- $Id: group2.tests,v 1.3 2019-02-07 14:31:59-08 - - $

yes
| ?- compiling /afs/cats.ucsc.edu/users/o/qvdang/cs112/assignments/assignment5/score/database.pl for byte code...
/afs/cats.ucsc.edu/users/o/qvdang/cs112/assignments/assignment5/score/database.pl compiled, 76 lines read - 11211 bytes written, 8 ms

yes
| ?- compiling /afs/cats.ucsc.edu/users/o/qvdang/cs112/assignments/assignment5/score/functions.pl for byte code...
/afs/cats.ucsc.edu/users/o/qvdang/cs112/assignments/assignment5/score/functions.pl compiled, 133 lines read - 16879 bytes written, 10 ms

(3 ms) yes
| ?- There is no flight from SJC San Jose         to DFW Dallas-Ft.Worth 

(1 ms) no
| ?- depart SFO San Francisco    M: 0
9:00
arrive LAX Los Angeles      9:41
depart LAX Los Angeles      M: 0
12:00
arrive SJC San Jose         12:37

yes
| ?- depart SJC San Jose         11:15
arrive LAX Los Angeles      11:52

yes
| ?- depart SFO San Francisco    M: 0
9:00
arrive LAX Los Angeles      9:41
depart LAX Los Angeles      13:30
arrive SEA Seattle-Tacoma   15:25

yes
| ?- depart MIA Miami            M: 0
9:00
arrive ATL Atlanta          10:11
depart ATL Atlanta          8:30
arrive LAX Los Angeles      12:23

yes
| ?- depart MIA Miami            M: 0
9:00
arrive ATL Atlanta          10:11
depart ATL Atlanta          8:30
arrive LAX Los Angeles      12:23
depart LAX Los Angeles      M: 0
12:00
arrive SJC San Jose         12:37

yes
| ?- depart LAX Los Angeles      M: 0
14:00
arrive NYC New York City    18:55

yes
| ?- 
